# Question
Alexis: the master DF seems inflated (i.e. having more rows) after merging in LGA - i think this is due to some postcodes correspond to multiple LGAs. For example if one postcode sits across 2 LGAs, it will expand to 2 rows after adding LGA. Needs some investigation around this.

# to do 12/10/21
**Chris**
- put LGA fixing from step 6 into pt2 (DONE)
- merge remaining features:  incp_gr, cprf, yields_join, df_cons_clean, quarter_rates (DONE)
- **NEW - Generate a new Table of Content**, Alexis: not sure how to do it lol - did you use some sort of extension? I hope I've named the sections properly for it to work!
- **NEW - Can you please investigate the problem mentioned above? i.e. more rows after merging in LGA/features, comparing to the original housing DF? adding features should only adding columns but not rows

**Alexis**
- merge with steve (DONE)

**Ken / Felix**
- check for nans (think of any columns or variables that we may not need) 
- sort out geopandas

Felix wnts to know the goal of the different dataframes so he can have a good understanding of the structure of the DFs.

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#1.-Bond-Yields" data-toc-modified-id="1.-Bond-Yields-0.1"><span class="toc-item-num">0.1&nbsp;&nbsp;</span>1. Bond Yields</a></span><ul class="toc-item"><li><span><a href="#@all-target-df-to-be-defined" data-toc-modified-id="@all-target-df-to-be-defined-0.1.1"><span class="toc-item-num">0.1.1&nbsp;&nbsp;</span>@all target df to be defined</a></span></li></ul></li><li><span><a href="#2.-Interest-Rate" data-toc-modified-id="2.-Interest-Rate-0.2"><span class="toc-item-num">0.2&nbsp;&nbsp;</span>2. Interest Rate</a></span><ul class="toc-item"><li><span><a href="#@all-target-df-do-be-defined" data-toc-modified-id="@all-target-df-do-be-defined-0.2.1"><span class="toc-item-num">0.2.1&nbsp;&nbsp;</span>@all target df do be defined</a></span></li></ul></li><li><span><a href="#3.-Population-/-Age-bands" data-toc-modified-id="3.-Population-/-Age-bands-0.3"><span class="toc-item-num">0.3&nbsp;&nbsp;</span>3. Population / Age bands</a></span><ul class="toc-item"><li><span><a href="#Household-count" data-toc-modified-id="Household-count-0.3.1"><span class="toc-item-num">0.3.1&nbsp;&nbsp;</span>Household count</a></span></li><li><span><a href="#Population-movement-in-5-year-period" data-toc-modified-id="Population-movement-in-5-year-period-0.3.2"><span class="toc-item-num">0.3.2&nbsp;&nbsp;</span>Population movement in 5 year period</a></span></li><li><span><a href="#Population-Age" data-toc-modified-id="Population-Age-0.3.3"><span class="toc-item-num">0.3.3&nbsp;&nbsp;</span>Population Age</a></span></li></ul></li><li><span><a href="#4.-Construction" data-toc-modified-id="4.-Construction-0.4"><span class="toc-item-num">0.4&nbsp;&nbsp;</span>4. Construction</a></span></li><li><span><a href="#5.-Weekly-Income" data-toc-modified-id="5.-Weekly-Income-0.5"><span class="toc-item-num">0.5&nbsp;&nbsp;</span>5. Weekly Income</a></span></li><li><span><a href="#6.-Household-size" data-toc-modified-id="6.-Household-size-0.6"><span class="toc-item-num">0.6&nbsp;&nbsp;</span>6. Household size</a></span></li><li><span><a href="#7.-Additional-Feature-1" data-toc-modified-id="7.-Additional-Feature-1-0.7"><span class="toc-item-num">0.7&nbsp;&nbsp;</span>7. Additional Feature 1</a></span></li><li><span><a href="#8.-Additional-Feature-2" data-toc-modified-id="8.-Additional-Feature-2-0.8"><span class="toc-item-num">0.8&nbsp;&nbsp;</span>8. Additional Feature 2</a></span></li><li><span><a href="#9.-Additional-Feature-3" data-toc-modified-id="9.-Additional-Feature-3-0.9"><span class="toc-item-num">0.9&nbsp;&nbsp;</span>9. Additional Feature 3</a></span></li></ul></li><li><span><a href="#USE-BELOW-CELL-TO-MERGE-FEATURES-INTO-THE-MASTER-DF,-IGNORE-FOR-NOW" data-toc-modified-id="USE-BELOW-CELL-TO-MERGE-FEATURES-INTO-THE-MASTER-DF,-IGNORE-FOR-NOW-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>USE BELOW CELL TO MERGE FEATURES INTO THE MASTER DF, IGNORE FOR NOW</a></span></li></ul></div>

**The objective of this notebook is to collate the codes for cleaning below data:**
1. Bond yields (F)
2. Ineterest rate (F)
3. Population (K)
4. Construction (K)
5. Weekly income (A)
6. Household size (A)

(please add features to the list if there's any additional ones)

**and merge all features into a complete feature set at the end.**

In [1]:
import pandas as pd
import numpy as np
import datetime as dt
import matplotlib.pyplot as plt
import seaborn as sns

## I. Feature Cleaning

### I-1. Bond Yields ###
`yields_join`

In [2]:
# read data in 
yields_data = "Files/Bond Yields/f02hist.xls"
yields = pd.read_excel(yields_data, sheet_name='Data', usecols='A:B,E', header=None, skiprows=range(0,12))
yields.columns = ['Date', '2yBonds%', '10yBonds%']
yields.head()

        Date  2yBonds%  10yBonds%
0 2013-07-31    2.5375      3.750
1 2013-08-31    2.5000      3.860
2 2013-09-30    2.6875      3.995
3 2013-10-31    2.7075      3.970
4 2013-11-30    2.7700      4.125

In [3]:
# split date column into year and month
dates = pd.to_datetime(yields["Date"])
yields["Year"] = dates.dt.year
yields["Quarter"] = dates.dt.quarter

# set datetime as index
yields.set_index('Date', inplace = True)

In [4]:
# create new column with average rate per quarter
yields_quarter_rates = yields.resample('QS').mean()
yields_quarter_rates.head(2)

            2yBonds%  10yBonds%    Year  Quarter
Date
2013-07-01  2.575000   3.868333  2013.0      3.0
2013-10-01  2.729167   4.112500  2013.0      4.0

In [5]:
# convert year and quarter to int
yields_quarter_rates["Year"] = yields_quarter_rates["Year"].astype(int)
yields_quarter_rates["Quarter"] = yields_quarter_rates["Quarter"].astype(int)

# create time period variable from 'Year' and 'Quarter'
yields_quarter_rates["time_period"] = yields_quarter_rates["Year"].map(str) + " Q" + yields_quarter_rates["Quarter"].map(str)

# Drop 'Year' and Quarter 
yields_join = yields_quarter_rates[["time_period", "2yBonds%", "10yBonds%"]] 
yields_join.head()

           time_period  2yBonds%  10yBonds%
Date
2013-07-01     2013 Q3  2.575000   3.868333
2013-10-01     2013 Q4  2.729167   4.112500
2014-01-01     2014 Q1  2.700000   4.135000
2014-04-01     2014 Q2  2.685000   3.835833
2014-07-01     2014 Q3  2.583333   3.474167

The resulting cleaned bond yield df is **yields_join**.

----

### I-2. Interest Rate ###
`rates_join`

In [6]:
# read data in
interest = "Files/Interest Rates/f01d.xls"
interest = pd.read_excel(interest, sheet_name = "Data", usecols = "A:B", header = None, skiprows = range(0,12))
interest.columns = ['Date', 'Rate']

# get date time
dates = pd.to_datetime(interest["Date"])
interest["Year"] = dates.dt.year
interest["Quarter"] = dates.dt.quarter

# set date as index
interest.set_index('Date', inplace = True)


# calculate average
quarter_rates = interest.resample('QS').mean()

# create new column with average rate per quarter
quarter_rates["Year"] = quarter_rates["Year"].astype(int)
quarter_rates["Quarter"] = quarter_rates["Quarter"].astype(int)

# time period
quarter_rates["time_period"] = quarter_rates["Year"].map(str) + " Q" + quarter_rates["Quarter"].map(str)

# remove Year and Quarter
quarter_rates = quarter_rates[['Rate','time_period']]
quarter_rates.head()

               Rate time_period
Date
2011-01-01  4.75000     2011 Q1
2011-04-01  4.75000     2011 Q2
2011-07-01  4.75000     2011 Q3
2011-10-01  4.52381     2011 Q4
2012-01-01  4.25000     2012 Q1

In [7]:
# read data in
interest = "Files/Interest Rates/f01d.xls"

interest = pd.read_excel(interest, sheet_name = "Data", usecols = "A:B", header = None, skiprows = range(0,12))
interest.columns = ['Date', 'Rate']
interest.head()

        Date  Rate
0 2011-01-05  4.75
1 2011-01-06  4.75
2 2011-01-07  4.75
3 2011-01-10  4.75
4 2011-01-11  4.75

In [8]:
# check data types
interest.dtypes

Date    datetime64[ns]
Rate           float64
dtype: object

In [9]:
# split date column into year and month
dates = pd.to_datetime(interest["Date"])
interest["Year"] = dates.dt.year
interest["Quarter"] = dates.dt.quarter

# set datetime as index
interest.set_index('Date', inplace = True)

In [10]:
# create new column with average rate per quarter
quarter_rates = interest.resample('QS').mean()
quarter_rates.head(2)

            Rate    Year  Quarter
Date
2011-01-01  4.75  2011.0      1.0
2011-04-01  4.75  2011.0      2.0

In [11]:
# convert year and quarter to int
quarter_rates["Year"] = quarter_rates["Year"].astype(int)
quarter_rates["Quarter"] = quarter_rates["Quarter"].astype(int)

# create time period variable for join from 'Year' and 'Quarter'
quarter_rates["time_period"] = quarter_rates["Year"].map(str) + " Q" + quarter_rates["Quarter"].map(str)
quarter_rates.head()

# Drop 'Year' and 'Quarter'
rates_join = quarter_rates[["time_period", "Rate"]]
rates_join.head(2)

           time_period  Rate
Date
2011-01-01     2011 Q1  4.75
2011-04-01     2011 Q2  4.75

The resulting cleaned bond yield df is **rates_join**.

----

### I-3. Population / Age bands

#### I-3.1 Household count
`hhold`

In [12]:
# Read data
popfile = "Files/Population/2019 NSW Population Projections ASGS 2019 LGA.xlsx"
df_hhold_wide = pd.read_excel(popfile,sheet_name='LGA Household Totals',header=6,usecols="A:C",skipfooter=3)
df_hhold_wide.columns=['LGA','hhold_count_2016','hhold_count_2021']
df_hhold_wide['LGA'] = df_hhold_wide.LGA.str.split('(').str.get(0)
df_hhold_wide['LGA'] = df_hhold_wide.LGA.str.strip()
df_hhold_wide.head(3)

                 LGA  hhold_count_2016  hhold_count_2021
0             Albury             21940             23227
1  Armidale Regional             11755             13041
2            Ballina             18178             19080

In [13]:
# Calculate difference in HH counts between 2016 and 2021
df_hhold_wide['hhold_count_delta'] = df_hhold_wide.hhold_count_2021 - df_hhold_wide.hhold_count_2016

# Shorten df name
hhold = df_hhold_wide
hhold.head()

                 LGA  hhold_count_2016  hhold_count_2021  hhold_count_delta
0             Albury             21940             23227               1287
1  Armidale Regional             11755             13041               1286
2            Ballina             18178             19080                902
3          Balranald               963              1015                 52
4  Bathurst Regional             16105             17351               1246

The resulting cleaned houshold count df is **hhold**.

Please note that the some of the LGA names in hhold don't match exactly those in our master df. We will resolve this in later section of this notebook. 

----

#### I-3.2 Population movement in 5 year period
`move`

In [14]:
# Read dta
popfile = "Files/Population/2019 NSW Population Projections ASGS 2019 LGA.xlsx"
df_move = pd.read_excel(popfile,sheet_name='LGA population accounts', header=5, skipfooter=3, usecols="A:C")
df_move.columns=['LGA','pop_move','2016-2021']
df_move['LGA'] = df_move.LGA.str.split('(').str.get(0) #Get rid of the bracket in each LGA name
df_move['LGA'] = df_move.LGA.str.strip() # remove the space
df_move.head(8)

                 LGA                       pop_move  2016-2021
0             Albury  Population at Start of Period      52171
1             Albury                         Births       3390
2             Albury                         Deaths       2219
3             Albury                 Natural change       1171
4             Albury    Net Migration (all sources)       1031
5             Albury    Population at End of Period      54374
6  Armidale Regional  Population at Start of Period      30313
7  Armidale Regional                         Births       1768

In [15]:
# Pivot features from rows to columns
df_move_melt = pd.melt(df_move,id_vars=['LGA','pop_move'], value_vars=['2016-2021'], var_name='year')
df_move_pivot = df_move_melt.pivot(index=['LGA','year'], columns='pop_move', values='value').reset_index()

# Rename columns
df_move_pivot = df_move_pivot.rename(columns={'    Births':'Births_16_21', 
                                              '    Deaths':'Deaths_16_21',
                                              'Population at End of Period':'population_2021',
                                              'Population at Start of Period':'population_2016'})

# Drop the 'year' column
df_move_pivot = df_move_pivot.drop(columns=['year'],axis=1)
df_move_pivot['LGA'] = df_move_pivot.LGA.str.strip() 
df_move_pivot.head(1)

pop_move,LGA,Births_16_21,Deaths_16_21,Natural change,Net Migration (all sources),population_2021,population_2016
0,Albury,3390.0,2219.0,1171.0,1031.0,54374.0,52171.0

In [16]:
# Create delta variable for population difference 
df_move_pivot['pop_delta'] = df_move_pivot['population_2021'] - df_move_pivot['population_2016']

# Shorten df name
move = df_move_pivot

move.head(1)

pop_move,LGA,Births_16_21,Deaths_16_21,Natural change,Net Migration (all sources),population_2021,population_2016,pop_delta
0,Albury,3390.0,2219.0,1171.0,1031.0,54374.0,52171.0,2203.0

The resulting cleaned population movement df is **move**.

Please note that the some of the LGA names in move don't match exactly those in our master df. We will resolve this in later section of this notebook. 

----

#### I-3.3 Population Age
`ageband`

In [17]:
# Read data
popfile = "Files/Population/2019 NSW Population Projections ASGS 2019 LGA.xlsx"
df_age = pd.read_excel(popfile,sheet_name='LGA Sex Age projections',header=5,usecols="A:E",skipfooter=3)
df_age.columns=['LGA','sex','age','2016','2021']
df_age['LGA'] = df_age.LGA.str.split('(').str.get(0)
df_age['LGA'] = df_age.LGA.str.strip() 
df_age.head(20)

       LGA     sex    age  2016  2021
0   Albury  Female  00-04  1693  1661
1   Albury  Female  05-09  1597  1694
2   Albury  Female  10-14  1617  1647
3   Albury  Female  15-19  1705  1724
4   Albury  Female  20-24  1928  1785
5   Albury  Female  25-29  1766  1740
6   Albury  Female  30-34  1693  1781
7   Albury  Female  35-39  1623  1815
8   Albury  Female  40-44  1665  1651
9   Albury  Female  45-49  1708  1723
10  Albury  Female  50-54  1634  1701
11  Albury  Female  55-59  1725  1640
12  Albury  Female  60-64  1552  1730
13  Albury  Female  65-69  1377  1593
14  Albury  Female  70-74  1137  1398
15  Albury  Female  75-79   914  1084
16  Albury  Female  80-84   709   807
17  Albury  Female    85+   844   894
18  Albury    Male  00-04  1812  1740
19  Albury    Male  05-09  1682  1816

In [18]:
# Create a variable for change of population by age band
df_age['age_delta'] = df_age['2021'] - df_age['2016']

# Combine the population of both genders
df_age_pivot = pd.pivot_table(df_age,index=['LGA','age'], values=['2016','2021','age_delta'], 
               aggfunc=({'2016':np.sum, '2021':np.sum, 'age_delta':np.sum})).reset_index()
df_age_pivot['LGA'] = df_age_pivot['LGA'].str.strip()

df_age_pivot.head()

      LGA    age  2016  2021  age_delta
0  Albury  00-04  3505  3401       -104
1  Albury  05-09  3279  3510        231
2  Albury  10-14  3228  3370        142
3  Albury  15-19  3381  3306        -75
4  Albury  20-24  3744  3448       -296

We'll lump the age brackets into fewer bands for ease of future analysis:
* Child: 0-14
* Youth: 15-24
* Adult: 25-44
* MiddleAge: 45-64
* Senior: 65+

In [19]:
# Group age brackets into 5 bandsd
Child = df_age_pivot.age.unique()[:3]
Youth = df_age_pivot.age.unique()[3:5]
Adult = df_age_pivot.age.unique()[5:9]
MiddleAge = df_age_pivot.age.unique()[9:13]
Senior = df_age_pivot.age.unique()[13:]

# Add ageband label
age_categ = [df_age_pivot['age'].isin(Child),
             df_age_pivot['age'].isin(Youth),
             df_age_pivot['age'].isin(Adult),
             df_age_pivot['age'].isin(MiddleAge),
             df_age_pivot['age'].isin(Senior)]

age_output = ['Child','Youth','Adult','MiddleAge','Senior']
df_age_pivot['age_bracket'] = np.select(age_categ,age_output)
df_age_pivot.head(20)

                  LGA    age  2016  2021  age_delta age_bracket
0              Albury  00-04  3505  3401       -104       Child
1              Albury  05-09  3279  3510        231       Child
2              Albury  10-14  3228  3370        142       Child
3              Albury  15-19  3381  3306        -75       Youth
4              Albury  20-24  3744  3448       -296       Youth
5              Albury  25-29  3485  3505         20       Adult
6              Albury  30-34  3400  3543        143       Adult
7              Albury  35-39  3143  3526        383       Adult
8              Albury  40-44  3206  3145        -61       Adult
9              Albury  45-49  3330  3284        -46   MiddleAge
10             Albury  50-54  3188  3308        120   MiddleAge
11             Albury  55-59  3322  3208       -114   MiddleAge
12             Albury  60-64  2987  3329        342   MiddleAge
13             Albury  65-69  2670  3018        348      Senior
14             Albury  70-74  2136  2661        525      Senior
15             Albury  75-79  1641  1991        350      Senior
16             Albury  80-84  1209  1402        193      Senior
17             Albury    85+  1317  1420        103      Senior
18  Armidale Regional  00-04  1816  1847         31       Child
19  Armidale Regional  05-09  1832  2032        200       Child

In [20]:
# Pivot by ageband and remove original groupings
age_bracket_delta = pd.pivot_table(df_age_pivot, index=['LGA'], columns=['age_bracket'], 
                                   values='age_delta', aggfunc=np.sum)

# Shorten df name
ageband = age_bracket_delta
ageband.reset_index(inplace=True)
ageband.head()

age_bracket                LGA  Adult  Child  MiddleAge  Senior  Youth
0                       Albury    485    269        302    1519   -371
1            Armidale Regional   1501    195        211     630   -114
2                      Ballina    -62   -186          5    1535    -48
3                    Balranald     14     36        -29     106    -20
4            Bathurst Regional    716    -73        476    1062   -112

The resulting cleaned population by age bracket df is **ageband**.

Please note that the some of the LGA names in ageband don't match exactly those in our master df. We will resolve this in later section of this notebook. 

----

### I-4. Construction  
`df_cons_clean`

In [21]:
# --read file, --rename columns
construction_file = "Files/Construction/Quarterly, Building construction prices rose, due to Homebuilder grants and government infrastructure investment.xlsx"
df_cons = pd.read_excel(construction_file,header=1,usecols="A:B", skipfooter=2)
df_cons.columns=['date','constr_index']

# --convert to datetime
df_cons['date'] = pd.to_datetime(df_cons['date'],format='%b-%y')

# --get year and quarter, --concatenate as time_period format, --drop other columns
df_cons['year'] = df_cons.date.dt.year
df_cons['quarter'] = df_cons.date.dt.quarter
df_cons['time_period'] = df_cons.year.map(str) + " Q" + df_cons.quarter.map(str)
df_cons_clean = df_cons.drop(columns=['date','year','quarter'],axis=1)
df_cons_clean.head()

   constr_index time_period
0         100.1     2012 Q2
1         100.3     2012 Q3
2         100.2     2012 Q4
3         101.0     2013 Q1
4         101.6     2013 Q2

### I-5. Weekly Income
`incp_gr`

In [22]:
# Read data in to the raw da
census_INCP = "Files/Census/POA (UR) by INCP Toal Personal Income (Weekly).csv"

incp_raw = pd.read_csv(census_INCP, skiprows=9, nrows=11142,
                       usecols=['POA (UR)', 'INCP Total Personal Income (weekly)', 'Count'])

# Rename column for easier referencing
incp_cols = {'POA (UR)':'postcode', 'INCP Total Personal Income (weekly)':'INCP_WK'}
incp_raw.rename(columns=incp_cols, inplace=True)

# Unstack
incp = incp_raw.groupby(['postcode','INCP_WK'])['Count'].sum().unstack()

# Remove the last row (grand total)
incp = incp[:-1]

incp.head(2)

INCP_WK,"$1,000-$1,249 ($52,000-$64,999)","$1,250-$1,499 ($65,000-$77,999)","$1,500-$1,749 ($78,000-$90,999)","$1,750-$1,999 ($91,000-$103,999)","$1-$149 ($1-$7,799)","$150-$299 ($7,800-$15,599)","$2,000-$2,999 ($104,000-$155,999)","$3,000 or more ($156,000 or more)","$300-$399 ($15,600-$20,799)","$400-$499 ($20,800-$25,999)","$500-$649 ($26,000-$33,799)","$650-$799 ($33,800-$41,599)","$800-$999 ($41,600-$51,999)",Negative income,Nil income,Not applicable,Not stated,Total
postcode,,,,,,,,,,,,,,,,,,
"2000, NSW",1676,1028,977,677,502,1112,1456,1796,1978,2201,1915,1599,1638,204,3297,1251,4115,27411
"2006, NSW",11,9,9,3,275,291,4,11,98,47,31,5,3,9,267,15,156,1261

In [23]:
# Remove 'NSW' in the index and cast postcode to int64
incp.reset_index(inplace=True)
incp['postcode'] = incp['postcode'].str.split(",").str.get(0)
incp['postcode'] = incp['postcode'].astype('int64')
incp = incp.set_index('postcode')

In [24]:
# Clean column names
income_cols= {'$1,000-$1,249 ($52,000-$64,999)' : '$1000-1249', 
            '$1,250-$1,499 ($65,000-$77,999)' : '$1250-1499',
            '$1,500-$1,749 ($78,000-$90,999)' : '$1500-1749 ', 
            '$1,750-$1,999 ($91,000-$103,999)': '$1750-1999',
            '$1-$149 ($1-$7,799)': '$1-149', 
            '$150-$299 ($7,800-$15,599)' : '$150-299',
            '$2,000-$2,999 ($104,000-$155,999)':'$2000-2999',
            '$3,000 or more ($156,000 or more)':'>=$3000', 
            '$300-$399 ($15,600-$20,799)':'$300-399',
            '$400-$499 ($20,800-$25,999)':'$400-499', 
            '$500-$649 ($26,000-$33,799)':'$500-649',
            '$650-$799 ($33,800-$41,599)':'$650-799', 
            '$800-$999 ($41,600-$51,999)':'$800-999'}
incp.rename(columns=income_cols, inplace=True)

# Combine 'not applicable' and 'not stated' into 'total_na'
incp['total_na'] = incp['Not applicable'] + incp['Not stated']

# Drop the 'Total column'
incp = incp.drop(columns=['Not applicable', 'Not stated', 'Total'], axis=1)

# Reorder columns
cols = incp.columns.tolist()
cols = ['$1-149','$150-299','$300-399','$400-499','$500-649','$650-799',
        '$800-999','$1000-1249','$1250-1499','$1500-1749 ',
        '$1750-1999','$2000-2999','>=$3000',
        'Negative income','Nil income','total_na']
incp=incp[cols]

incp.head(1)

INCP_WK,$1-149,$150-299,$300-399,$400-499,$500-649,$650-799,$800-999,$1000-1249,$1250-1499,$1500-1749,$1750-1999,$2000-2999,>=$3000,Negative income,Nil income,total_na
postcode,,,,,,,,,,,,,,,,
2000,502,1112,1978,2201,1915,1599,1638,1676,1028,977,677,1456,1796,204,3297,5366

In [25]:
# Create income buckets and save into incp_gr
incp['INCP_LOW'] = incp.iloc[:, 0:6].sum(axis=1)
incp['INCP_MID'] = incp.iloc[:, 6:10].sum(axis=1)
incp['INCP_HIGH'] = incp.iloc[:, 10:13].sum(axis=1)
incp['INCP_NEG_NIL'] = incp.iloc[:, 13:15].sum(axis=1)
incp_gr = incp[['INCP_LOW', 'INCP_MID', 'INCP_HIGH', 'INCP_NEG_NIL']]

# Reset index
incp_gr.reset_index(inplace=True)

incp_gr.head(1)

INCP_WK  postcode  INCP_LOW  INCP_MID  INCP_HIGH  INCP_NEG_NIL
0            2000      9307      5319       3929          3501

*The resulting cleanead df is <b>incp_gr</b>*

----

### I-6. Household size
`cprf`

In [26]:
# Read data
census_cprf = "Files/Census/POA by CPRF Count of Persons in Family by STATE.xlsx"
cprf = pd.read_excel(census_cprf, sheet_name="Data Sheet 0", skiprows=9, nrows=619)

# Remove redundant rows and columns 
cprf = cprf[1:] #remove the first row
cprf = cprf.drop(columns='CPRF Count of Persons in Family') # remove the first column

# Rename columns
cprf_cols= {'Unnamed: 1' : 'postcode', 
            'Two persons in family' : 'CPRF_2',
            'Three persons in family' : 'CPRF_3', 
            'Four persons in family': 'CPRF_4',
            'Five persons in family': 'CPRF_5', 
            'Six or more persons in family' : 'CPRF_6+',
            'Not applicable':'CPRF_na',
            'Total' :'CPRF_TOTAL_FAM_NO'}
cprf.rename(columns=cprf_cols, inplace=True)

cprf.head(1)

,postcode,CPRF_2,CPRF_3,CPRF_4,CPRF_5,CPRF_6+,CPRF_na,CPRF_TOTAL_FAM_NO
1,"2000, NSW",3453.0,857.0,354.0,54.0,21.0,8125.0,12861.0

In [27]:
# Remove 'NSW' in the index and cast postcode to int64
cprf.reset_index(inplace=True)
cprf['postcode'] = cprf['postcode'].str.split(",").str.get(0)
cprf['postcode'] = cprf['postcode'].astype('int64')
cprf = cprf.set_index('postcode')
cprf = cprf.drop(columns='index', axis=1)

In [28]:
# Reset index for merging
cprf.reset_index(inplace=True)
cprf.head(1)

,postcode,CPRF_2,CPRF_3,CPRF_4,CPRF_5,CPRF_6+,CPRF_na,CPRF_TOTAL_FAM_NO
0,2000,3453.0,857.0,354.0,54.0,21.0,8125.0,12861.0

*The resulting cleanead df is <b>cprf</b>*

----

## II-LGA Mapping

The unique area identifier in the master housing df is postcode, however some of our features (household counts, population age and movements) are grouped by LGA. Hence, we have two tasks are hand:
1. Map postcodes in the master df to LGA using the **mapping** data file.
2. Resolve the mismatch of LGA names between the **mapping** df and the **feature dfs** (`hhold`,`move`,`ageband`) before they can be harmonised

### II-1. Add LGA to housing data

In [29]:
# Read master housing data we cleaned and merged earlier
master = pd.read_csv("Files/Cleaned/Master_Sales_Rent_2017Q4_2021Q1.csv")

# Number of postcodes in the master df
print("number of postcodes in the master housing df:", master['postcode'].nunique())

# Store unique postcodes in the master df to an array
pc_master = master['postcode'].unique()

number of postcodes in the master housing df: 587

In [30]:
# Read postcode-LGA mapping data into df
lga_poa = "Files/Area/Postcode_and_LGA.xlsx"
mapping = pd.read_excel(lga_poa, sheet_name="SuburbLGA", 
                        usecols=['lganame','councilnam','suburbname','postcode'])
# Drop na
mapping = mapping.dropna()

# Rename columns 
rename_cols= {'lganame':'LGA',
              'councilnam':'council', 
              'suburbname':'suburb'}
mapping.rename(columns=rename_cols,inplace=True)

mapping.head()

           LGA              council           suburb  postcode
0  ALBURY CITY  ALBURY CITY COUNCIL           ALBURY    2640.0
1  ALBURY CITY  ALBURY CITY COUNCIL      EAST ALBURY    2640.0
2  ALBURY CITY  ALBURY CITY COUNCIL        ETTAMOGAH    2640.0
3  ALBURY CITY  ALBURY CITY COUNCIL          GLENROY    2640.0
4  ALBURY CITY  ALBURY CITY COUNCIL  HAMILTON VALLEY    2641.0

In [31]:
# Number of postcodes in the mapping  df
print("number of postcodes in the mapping df:", mapping['postcode'].nunique())

# Store unique postcodes in the mapping df to an array
pc_map = mapping['postcode'].unique()

number of postcodes in the mapping df: 622

In [32]:
# Check if the mapping df covers all the postcodes in the housing df
pc_shared = list(set(pc_master).intersection(pc_map))
print("number of postcodes in both lists:", len(pc_shared))

number of postcodes in both lists: 587

Great news - yes it does. 

However, the mapping df is not complete nor 100% accurate for some reason, there're postcodes that clearly belong to certain LGAs were mistaken as 'UNINCORPORATED'. We need to correct these errors before adding LGA info to the housing data.

In [33]:
# Dealing with the unincorporated

unico = mapping.loc[mapping.LGA=='UNINCORPORATED']
print("number of unicorporated postcodes:", unico['postcode'].nunique())
unico = unico.sort_values(by='postcode', ascending=True)
unico

number of unicorporated postcodes: 20

                 LGA                  council           suburb  postcode
4576  UNINCORPORATED           UNINCORPORATED       BARANGAROO    2000.0
4581  UNINCORPORATED           UNINCORPORATED      DAWES POINT    2000.0
4605  UNINCORPORATED           UNINCORPORATED           SYDNEY    2000.0
4594  UNINCORPORATED           UNINCORPORATED    MILLERS POINT    2000.0
4602  UNINCORPORATED           UNINCORPORATED          PYRMONT    2009.0
4611  UNINCORPORATED           UNINCORPORATED    WOOLLOOMOOLOO    2011.0
4582  UNINCORPORATED           UNINCORPORATED       DOUBLE BAY    2028.0
4609  UNINCORPORATED           UNINCORPORATED      WATSONS BAY    2030.0
4607  UNINCORPORATED           UNINCORPORATED         VAUCLUSE    2030.0
4575  UNINCORPORATED           UNINCORPORATED          BALMAIN    2041.0
4577  UNINCORPORATED           UNINCORPORATED       BIRCHGROVE    2041.0
4574  UNINCORPORATED           UNINCORPORATED       ABBOTSFORD    2046.0
4583  UNINCORPORATED           UNINCORPORATED        DRUMMOYNE    2047.0
4587  UNINCORPORATED           UNINCORPORATED       KIRRIBILLI    2061.0
4589  UNINCORPORATED           UNINCORPORATED  LANE COVE NORTH    2066.0
4596  UNINCORPORATED           UNINCORPORATED           MOSMAN    2088.0
4588  UNINCORPORATED           UNINCORPORATED    KURRABA POINT    2089.0
4598  UNINCORPORATED           UNINCORPORATED      NEUTRAL BAY    2089.0
4591  UNINCORPORATED           UNINCORPORATED            MANLY    2095.0
4586  UNINCORPORATED           UNINCORPORATED     HUNTERS HILL    2110.0
4585  UNINCORPORATED           UNINCORPORATED      GLADESVILLE    2111.0
4603  UNINCORPORATED  UNINCORPORATED FAR WEST           SCOTIA    2648.0
4601  UNINCORPORATED  UNINCORPORATED FAR WEST        POONCARIE    2648.0
4610  UNINCORPORATED  UNINCORPORATED FAR WEST     WHITE CLIFFS    2836.0
4608  UNINCORPORATED  UNINCORPORATED FAR WEST        WANAARING    2840.0
4592  UNINCORPORATED  UNINCORPORATED FAR WEST         MENINDEE    2879.0
4597  UNINCORPORATED  UNINCORPORATED FAR WEST       MUTAWINTJI    2880.0
4604  UNINCORPORATED  UNINCORPORATED FAR WEST        SILVERTON    2880.0
4595  UNINCORPORATED  UNINCORPORATED FAR WEST       MILPARINKA    2880.0
4606  UNINCORPORATED  UNINCORPORATED FAR WEST       TIBOOBURRA    2880.0
4580  UNINCORPORATED  UNINCORPORATED FAR WEST   BROUGHAMS GATE    2880.0
4590  UNINCORPORATED  UNINCORPORATED FAR WEST     LITTLE TOPAR    2880.0
4579  UNINCORPORATED  UNINCORPORATED FAR WEST      BROKEN HILL    2880.0
4584  UNINCORPORATED  UNINCORPORATED FAR WEST      FOWLERS GAP    2880.0
4600  UNINCORPORATED  UNINCORPORATED FAR WEST       PACKSADDLE    2880.0

In [34]:
# Import manully looked-up LGAs for unicorporated ones

patch = ["SYDNEY",
"SYDNEY",
"SYDNEY",
"SYDNEY",
"SYDNEY",
"SYDNEY",
"WOOLLAHRA",
"WOOLLAHRA",
"WOOLLAHRA",
"INNER WEST",
"INNER WEST",
"CANADA BAY",
"CANADA BAY",
"NORTH SYDNEY",
"LANE COVE",
"MOSMAN",
"NORTH SYDNEY",
"NORTH SYDNEY",
"NORTHERN BEACHES",
"HUNTERS HILL",
"RYDE",
"WENTWORTH",
"WENTWORTH",
"CENTRAL DARLING",
"BOURKE",
"CENTRAL DARLING",
"UNICORPORATED FAR WEST",
"UNICORPORATED FAR WEST",
"UNICORPORATED FAR WEST",
"UNICORPORATED FAR WEST",
"UNICORPORATED FAR WEST",
"UNICORPORATED FAR WEST",
"UNICORPORATED FAR WEST",
"UNICORPORATED FAR WEST",
"UNICORPORATED FAR WEST"]

# Add patch
unico['LGA patch'] = patch

# Drop LGA
unico = unico.drop(columns=['LGA'],axis=1)

# Remane patch as the new LGA
unico = unico.rename(columns={"LGA patch":"LGA"})

# Reorder columns
cols = ['LGA', 'council', 'suburb', 'postcode']
unico = unico[cols]

unico.loc[unico['council']=='UNINCORPORATED']

                   LGA         council           suburb  postcode
4576            SYDNEY  UNINCORPORATED       BARANGAROO    2000.0
4581            SYDNEY  UNINCORPORATED      DAWES POINT    2000.0
4605            SYDNEY  UNINCORPORATED           SYDNEY    2000.0
4594            SYDNEY  UNINCORPORATED    MILLERS POINT    2000.0
4602            SYDNEY  UNINCORPORATED          PYRMONT    2009.0
4611            SYDNEY  UNINCORPORATED    WOOLLOOMOOLOO    2011.0
4582         WOOLLAHRA  UNINCORPORATED       DOUBLE BAY    2028.0
4609         WOOLLAHRA  UNINCORPORATED      WATSONS BAY    2030.0
4607         WOOLLAHRA  UNINCORPORATED         VAUCLUSE    2030.0
4575        INNER WEST  UNINCORPORATED          BALMAIN    2041.0
4577        INNER WEST  UNINCORPORATED       BIRCHGROVE    2041.0
4574        CANADA BAY  UNINCORPORATED       ABBOTSFORD    2046.0
4583        CANADA BAY  UNINCORPORATED        DRUMMOYNE    2047.0
4587      NORTH SYDNEY  UNINCORPORATED       KIRRIBILLI    2061.0
4589         LANE COVE  UNINCORPORATED  LANE COVE NORTH    2066.0
4596            MOSMAN  UNINCORPORATED           MOSMAN    2088.0
4588      NORTH SYDNEY  UNINCORPORATED    KURRABA POINT    2089.0
4598      NORTH SYDNEY  UNINCORPORATED      NEUTRAL BAY    2089.0
4591  NORTHERN BEACHES  UNINCORPORATED            MANLY    2095.0
4586      HUNTERS HILL  UNINCORPORATED     HUNTERS HILL    2110.0
4585              RYDE  UNINCORPORATED      GLADESVILLE    2111.0

In [35]:
# Append fixed rows back to the mapping file

mapping = mapping.loc[mapping['LGA'] != "UNINCORPORATED"]
mapping = mapping.append(unico)

# Save complete mapping df to csv
mapping.to_csv('Files/Area/Cleaned_LGA_Mapping_07102021.csv', index=False)

Now that we've fixed the errors in the mapping data, we're ready to add it in to the housing data. Recall that we have **three versions** of cleaned housing data files that we consider 'master' - one stacked and two unstacked. We're going to add LGA to all three of them for future use.

In [36]:
# Drop the suburb and council columns
mapping_reduce = mapping.drop(columns=['council','suburb'], axis=1)

# Drop duplicates
mapping_reduce = mapping_reduce.drop_duplicates()

mapping_reduce.head(2)

           LGA  postcode
0  ALBURY CITY    2640.0
4  ALBURY CITY    2641.0

In [37]:
sorted(list(mapping_reduce['LGA'].unique()))

['ALBURY CITY',
 'ARMIDALE REGIONAL',
 'BALLINA',
 'BALRANALD',
 'BATHURST REGIONAL',
 'BAYSIDE',
 'BEGA VALLEY',
 'BELLINGEN',
 'BERRIGAN',
 'BLACKTOWN',
 'BLAND',
 'BLAYNEY',
 'BLUE MOUNTAINS',
 'BOGAN',
 'BOURKE',
 'BREWARRINA',
 'BROKEN HILL',
 'BURWOOD',
 'BYRON',
 'CABONNE',
 'CAMDEN',
 'CAMPBELLTOWN',
 'CANADA BAY',
 'CANTERBURY-BANKSTOWN',
 'CARRATHOOL',
 'CENTRAL COAST',
 'CENTRAL DARLING',
 'CESSNOCK',
 'CITY OF PARRAMATTA',
 'CLARENCE VALLEY',
 'COBAR',
 'COFFS HARBOUR',
 'COOLAMON',
 'COONAMBLE',
 'COOTAMUNDRA-GUNDAGAI REGIONAL',
 'COWRA',
 'CUMBERLAND',
 'DUBBO REGIONAL',
 'DUNGOG',
 'EDWARD RIVER',
 'EUROBODALLA',
 'FAIRFIELD',
 'FEDERATION',
 'FORBES',
 'GEORGES RIVER',
 'GILGANDRA',
 'GLEN INNES SEVERN',
 'GOULBURN MULWAREE',
 'GREATER HUME SHIRE',
 'GRIFFITH',
 'GUNNEDAH',
 'GWYDIR',
 'HAWKESBURY',
 'HAY',
 'HILLTOPS',
 'HORNSBY',
 'HUNTERS HILL',
 'INNER WEST',
 'INVERELL',
 'JUNEE',
 'KEMPSEY',
 'KIAMA',
 'KU-RING-GAI',
 'KYOGLE',
 'LACHLAN',
 'LAKE MACQUARIE',
 'LANE COVE',
 'LEETON',
 'LISMORE',
 'LITHGOW CITY',
 'LIVERPOOL',
 'LIVERPOOL PLAINS',
 'LOCKHART',
 'LORD HOWE ISLAND - UNINCORPORATED AREA',
 'MAITLAND',
 'MID-COAST',
 'MID-WESTERN REGIONAL',
 'MOREE PLAINS',
 'MOSMAN',
 'MURRAY RIVER',
 'MURRUMBIDGEE',
 'MUSWELLBROOK',
 'NAMBUCCA VALLEY',
 'NARRABRI',
 'NARRANDERA',
 'NARROMINE',
 'NEWCASTLE',
 'NORTH SYDNEY',
 'NORTHERN BEACHES',
 'OBERON',
 'ORANGE',
 'PARKES',
 'PENRITH',
 'PORT MACQUARIE-HASTINGS',
 'PORT STEPHENS',
 'QUEANBEYAN-PALERANG REGIONAL',
 'RANDWICK',
 'RICHMOND VALLEY',
 'RYDE',
 'SHELLHARBOUR',
 'SHOALHAVEN',
 'SINGLETON',
 'SNOWY MONARO REGIONAL',
 'SNOWY VALLEYS',
 'STRATHFIELD',
 'SUTHERLAND SHIRE',
 'SYDNEY',
 'TAMWORTH REGIONAL',
 'TEMORA',
 'TENTERFIELD',
 'THE HILLS SHIRE',
 'TWEED',
 'UNICORPORATED FAR WEST',
 'UPPER HUNTER',
 'UPPER LACHLAN SHIRE',
 'URALLA',
 'WAGGA WAGGA',
 'WALCHA',
 'WALGETT',
 'WARREN',
 'WARRUMBUNGLE',
 'WAVERLEY',
 'WEDDIN',
 'WENTWORTH',
 'WILLOUGHBY',
 'WINGECARRIBEE',
 'WOLLONDILLY',
 'WOLLONGONG',
 'WOOLLAHRA',
 'YASS VALLEY']

#### II-1.1 MASTER DF - STACKED

In [38]:
# Add LGA from mapping to master DF
master_map = master.merge(mapping_reduce, left_on='postcode', right_on='postcode')

cols = ['postcode', 'LGA','skey', 'time_period', 'year', 'quarter', 'dwelling_type',
       'median_price', 'mean_price', 'sales_no', 'Qdelta_median',
       'Adelta_median', 'Qdelta_count', 'Adelta_count', 'rkey',
       'median_rent_newb', 'new_bonds_no', 'total_bonds_no',
       'Qdelta_median_rent', 'Qdelta_new_bonds', 'Adelta_median_rent',
       'Adelta_new_bonds']

master_map = master_map[cols]
master_map.head(1)

,postcode,LGA,skey,time_period,year,quarter,dwelling_type,median_price,mean_price,sales_no,...,Qdelta_count,Adelta_count,rkey,median_rent_newb,new_bonds_no,total_bonds_no,Qdelta_median_rent,Qdelta_new_bonds,Adelta_median_rent,Adelta_new_bonds
0,2000,SYDNEY,s122,2017 Q3,2017,Q3,Total,1350.0,1516.328059,135.0,...,-0.325,-0.3112,r121,640.0,1169.0,7914.0,-0.2,0.5545,NaN,NaN

In [39]:
master_map.to_csv('Files/Cleaned/Master_Sales_Rent_2017Q4_2021Q1_wLGA.csv', index=False)

----

#### II-1.2 MASTER DF - UNSTACKED VER1

In [40]:
# Read master housing data we cleaned and merged earlier
master_pivot1 = pd.read_csv("Files/Cleaned/Pivot_Sales_Rent_5Quarters_SharedPOA.csv")
print("master_pivot1 shape:", master_pivot1.shape)
master_pivot1.head(1)

master_pivot1 shape: (493, 31)

,postcode,mean_price 2020 Q1,mean_price 2020 Q2,mean_price 2020 Q3,mean_price 2020 Q4,mean_price 2021 Q1,median_price 2020 Q1,median_price 2020 Q2,median_price 2020 Q3,median_price 2020 Q4,...,sales_no 2020 Q1,sales_no 2020 Q2,sales_no 2020 Q3,sales_no 2020 Q4,sales_no 2021 Q1,total_bonds_no 2020 Q1,total_bonds_no 2020 Q2,total_bonds_no 2020 Q3,total_bonds_no 2020 Q4,total_bonds_no 2021 Q1
0,2000,1541.0,1322.0,1631.0,1379.0,2794.0,1225.0,1000.0,1390.0,1110.0,...,105.0,74.0,100.0,155.0,184.0,8615.0,7595.0,8069.0,9140.0,9327.0

In [41]:
# Add LGA from mapping to master DF
master_pivot_map1 = master_pivot1.merge(mapping_reduce, left_on='postcode', right_on='postcode')

cols = ['postcode', 'LGA', 'mean_price 2020 Q1', 'mean_price 2020 Q2',
       'mean_price 2020 Q3', 'mean_price 2020 Q4', 'mean_price 2021 Q1',
       'median_price 2020 Q1', 'median_price 2020 Q2', 'median_price 2020 Q3',
       'median_price 2020 Q4', 'median_price 2021 Q1',
       'median_rent_newb 2020 Q1', 'median_rent_newb 2020 Q2',
       'median_rent_newb 2020 Q3', 'median_rent_newb 2020 Q4',
       'median_rent_newb 2021 Q1', 'new_bonds_no 2020 Q1',
       'new_bonds_no 2020 Q2', 'new_bonds_no 2020 Q3', 'new_bonds_no 2020 Q4',
       'new_bonds_no 2021 Q1', 'sales_no 2020 Q1', 'sales_no 2020 Q2',
       'sales_no 2020 Q3', 'sales_no 2020 Q4', 'sales_no 2021 Q1',
       'total_bonds_no 2020 Q1', 'total_bonds_no 2020 Q2',
       'total_bonds_no 2020 Q3', 'total_bonds_no 2020 Q4',
       'total_bonds_no 2021 Q1']

master_pivot_map1 = master_pivot_map1[cols]
master_pivot_map1.head(1)

,postcode,LGA,mean_price 2020 Q1,mean_price 2020 Q2,mean_price 2020 Q3,mean_price 2020 Q4,mean_price 2021 Q1,median_price 2020 Q1,median_price 2020 Q2,median_price 2020 Q3,...,sales_no 2020 Q1,sales_no 2020 Q2,sales_no 2020 Q3,sales_no 2020 Q4,sales_no 2021 Q1,total_bonds_no 2020 Q1,total_bonds_no 2020 Q2,total_bonds_no 2020 Q3,total_bonds_no 2020 Q4,total_bonds_no 2021 Q1
0,2000,SYDNEY,1541.0,1322.0,1631.0,1379.0,2794.0,1225.0,1000.0,1390.0,...,105.0,74.0,100.0,155.0,184.0,8615.0,7595.0,8069.0,9140.0,9327.0

In [42]:
master_pivot_map1.to_csv('Files/Cleaned/Master_Pivot_Sales_Rent_5Quarters_SharedPOA_wLGA.csv', index=False)

In [43]:
master
master_pivot_map1.shape

(858, 32)

----

#### II-1.3 MASTER UNSTACKED - VER2

In [44]:
# Read master housing data we cleaned and merged earlier
master_pivot2 = pd.read_csv("Files/Cleaned/Pivot_Sales_Rent_5Quarters_Imputed.csv")
print("master_pivot2 shape:", master_pivot2.shape)
master_pivot2.head(1)

master_pivot2 shape: (577, 31)

,postcode,mean_price 2020 Q1,mean_price 2020 Q2,mean_price 2020 Q3,mean_price 2020 Q4,mean_price 2021 Q1,median_price 2020 Q1,median_price 2020 Q2,median_price 2020 Q3,median_price 2020 Q4,...,sales_no 2020 Q1,sales_no 2020 Q2,sales_no 2020 Q3,sales_no 2020 Q4,sales_no 2021 Q1,total_bonds_no 2020 Q1,total_bonds_no 2020 Q2,total_bonds_no 2020 Q3,total_bonds_no 2020 Q4,total_bonds_no 2021 Q1
0,2000,1541.0,1322.0,1631.0,1379.0,2794.0,1225.0,1000.0,1390.0,1110.0,...,105.0,74.0,100.0,155.0,184.0,8615.0,7595.0,8069.0,9140.0,9327.0

In [45]:
# Add LGA from mapping to master DF
master_pivot_map2 = master_pivot2.merge(mapping_reduce, left_on='postcode', right_on='postcode')

cols = ['postcode', 'LGA', 'mean_price 2020 Q1', 'mean_price 2020 Q2',
       'mean_price 2020 Q3', 'mean_price 2020 Q4', 'mean_price 2021 Q1',
       'median_price 2020 Q1', 'median_price 2020 Q2', 'median_price 2020 Q3',
       'median_price 2020 Q4', 'median_price 2021 Q1',
       'median_rent_newb 2020 Q1', 'median_rent_newb 2020 Q2',
       'median_rent_newb 2020 Q3', 'median_rent_newb 2020 Q4',
       'median_rent_newb 2021 Q1', 'new_bonds_no 2020 Q1',
       'new_bonds_no 2020 Q2', 'new_bonds_no 2020 Q3', 'new_bonds_no 2020 Q4',
       'new_bonds_no 2021 Q1', 'sales_no 2020 Q1', 'sales_no 2020 Q2',
       'sales_no 2020 Q3', 'sales_no 2020 Q4', 'sales_no 2021 Q1',
       'total_bonds_no 2020 Q1', 'total_bonds_no 2020 Q2',
       'total_bonds_no 2020 Q3', 'total_bonds_no 2020 Q4',
       'total_bonds_no 2021 Q1']

master_pivot_map2 = master_pivot_map2[cols]
master_pivot_map2.head(1)

,postcode,LGA,mean_price 2020 Q1,mean_price 2020 Q2,mean_price 2020 Q3,mean_price 2020 Q4,mean_price 2021 Q1,median_price 2020 Q1,median_price 2020 Q2,median_price 2020 Q3,...,sales_no 2020 Q1,sales_no 2020 Q2,sales_no 2020 Q3,sales_no 2020 Q4,sales_no 2021 Q1,total_bonds_no 2020 Q1,total_bonds_no 2020 Q2,total_bonds_no 2020 Q3,total_bonds_no 2020 Q4,total_bonds_no 2021 Q1
0,2000,SYDNEY,1541.0,1322.0,1631.0,1379.0,2794.0,1225.0,1000.0,1390.0,...,105.0,74.0,100.0,155.0,184.0,8615.0,7595.0,8069.0,9140.0,9327.0

In [46]:
master_pivot_map2.to_csv('Files/Cleaned/Master_Pivot_Sales_Rent_5Quarters_Imputed_wLGA.csv', index=False)

----

### 2. Match LGA names in feature DFs to that in the master file

#### 2.1`hhold`

In [47]:
print("Number of LGAs in hhold:", hhold['LGA'].nunique())
print("Number of LGAs in mapping:", mapping['LGA'].nunique())

Number of LGAs in hhold: 129
Number of LGAs in mapping: 130

In [48]:
# Find shared LGA in both 
LGA_map = list(mapping['LGA'].unique())
LGA_hhold = list(hhold['LGA'].unique())
LGA_HHOLD = list(map(str.upper, LGA_hhold)) # Convert LGA in hhold to uppercase

LGA_shared= list(set(LGA_map).intersection(LGA_HHOLD))
print(len(LGA_shared))

122

In [49]:
# Find LGA in hhold ONLY
set(LGA_HHOLD) - set(LGA_shared)

{'ALBURY',
 'LITHGOW',
 'NAMBUCCA',
 'PARRAMATTA',
 'UNINCORPORATED NSW',
 'UPPER HUNTER SHIRE',
 'WARRUMBUNGLE SHIRE'}

In [50]:
# Match name, except for unincorporated NSW

hhold.loc[hhold.LGA=='Albury', 'LGA'] = 'ALBURY CITY'
hhold.loc[hhold.LGA=='Lithgow', 'LGA'] = 'LITHGOW CITY'
hhold.loc[hhold.LGA=='Nambucca', 'LGA'] = 'NAMBUCCA VALLEY'
hhold.loc[hhold.LGA=='Parramatta', 'LGA'] = 'CITY OF PARRAMATTA'
hhold.loc[hhold.LGA=='Upper Hunter Shire', 'LGA'] = 'UPPER HUNTER'
hhold.loc[hhold.LGA=='Warrumbungle Shire', 'LGA'] = 'WARRUMBUNGLE'

In [51]:
LGA_hhold2 = list(hhold['LGA'].unique())
LGA_HHOLD2 = list(map(str.upper, LGA_hhold2)) # Convert LGA in hhold to uppercase

LGA_shared= list(set(LGA_map).intersection(LGA_HHOLD2))
print("number of LGAs matched:", len(LGA_shared))
print("number of LGAs in the hhold df:", hhold['LGA'].nunique())

number of LGAs matched: 128
number of LGAs in the hhold df: 129

In [52]:
# making the LGAs uppercase
hhold['LGA'] = hhold['LGA'].str.upper()
hhold.head(1)

           LGA  hhold_count_2016  hhold_count_2021  hhold_count_delta
0  ALBURY CITY             21940             23227               1287

#### 2.2 `move`

In [53]:
move.head(1)

pop_move,LGA,Births_16_21,Deaths_16_21,Natural change,Net Migration (all sources),population_2021,population_2016,pop_delta
0,Albury,3390.0,2219.0,1171.0,1031.0,54374.0,52171.0,2203.0

In [54]:
# Check if ageband df and hhold df has the same LGAs
LGA_move = list(move['LGA'].unique())

print("Number of LGAs in the ageband df:", len(LGA_move))
move_hhold = list(set(LGA_hhold).intersection(LGA_move))
print("Common LGAs in raw move and raw hhold df:", len(move_hhold))

Number of LGAs in the ageband df: 129
Common LGAs in raw move and raw hhold df: 129

In [55]:
# Match name, except for unincorporated NSW
move.loc[move.LGA=='Albury', 'LGA'] = 'ALBURY CITY'
move.loc[move.LGA=='Lithgow', 'LGA'] = 'LITHGOW CITY'
move.loc[move.LGA=='Nambucca', 'LGA'] = 'NAMBUCCA VALLEY'
move.loc[move.LGA=='Parramatta', 'LGA'] = 'CITY OF PARRAMATTA'
move.loc[move.LGA=='Upper Hunter Shire', 'LGA'] = 'UPPER HUNTER'
move.loc[move.LGA=='Warrumbungle Shire', 'LGA'] = 'WARRUMBUNGLE'

move['LGA'] = move['LGA'].str.upper()

move.head()

pop_move,LGA,Births_16_21,Deaths_16_21,Natural change,Net Migration (all sources),population_2021,population_2016,pop_delta
0,ALBURY CITY,3390.0,2219.0,1171.0,1031.0,54374.0,52171.0,2203.0
1,ARMIDALE REGIONAL,1768.0,1266.0,502.0,1921.0,32736.0,30313.0,2423.0
2,BALLINA,1790.0,2491.0,-701.0,1945.0,44237.0,42993.0,1244.0
3,BALRANALD,194.0,96.0,98.0,8.0,2437.0,2330.0,107.0
4,BATHURST REGIONAL,2500.0,1710.0,790.0,1277.0,44310.0,42244.0,2066.0

In [56]:
# Check matching result

LGA_MOVE = list(move['LGA'].unique())
move_map= list(set(LGA_map).intersection(LGA_MOVE))
print("matched LGA in mapping and move:", len(move_map))

matched LGA in mapping and move: 128

#### 2.3 `ageband`

In [57]:
ageband.head(1)

age_bracket     LGA  Adult  Child  MiddleAge  Senior  Youth
0            Albury    485    269        302    1519   -371

In [58]:
# Check if ageband df and hhold df has the same LGAs
LGA_age = list(ageband['LGA'].unique())

print("Number of LGAs in the ageband df:", len(LGA_age))
age_hhold = list(set(LGA_hhold).intersection(LGA_age))
print("Common LGAs in raw move and raw hhold df:", len(age_hhold))

Number of LGAs in the ageband df: 129
Common LGAs in raw move and raw hhold df: 129

In [59]:
# Apply the same renaming procedure to ageband
ageband.loc[ageband.LGA=='Albury', 'LGA'] = 'ALBURY CITY'
ageband.loc[ageband.LGA=='Lithgow', 'LGA'] = 'LITHGOW CITY'
ageband.loc[ageband.LGA=='Nambucca', 'LGA'] = 'NAMBUCCA VALLEY'
ageband.loc[ageband.LGA=='Parramatta', 'LGA'] = 'CITY OF PARRAMATTA'
ageband.loc[ageband.LGA=='Upper Hunter Shire', 'LGA'] = 'UPPER HUNTER'
ageband.loc[ageband.LGA=='Warrumbungle Shire', 'LGA'] = 'WARRUMBUNGLE'

ageband['LGA'] = ageband['LGA'].str.upper()

ageband.head(1)

age_bracket          LGA  Adult  Child  MiddleAge  Senior  Youth
0            ALBURY CITY    485    269        302    1519   -371

In [60]:
# Check matching result
LGA_AGE = list(ageband['LGA'].unique())
age_map= list(set(LGA_map).intersection(LGA_AGE))
print("matched LGA in mapping and ageband:", len(age_map))

matched LGA in mapping and ageband: 128

----

## III. Group Features into Three DataFrames

For the 7 features we
1. Cross-section features using <u>LGA</u> as key: `hhold`, `move` and `ageband`, which we'll merge into **`features_LGA`**


2. Cross-section features using <u>postcodes</u> as key: taken from the 2016 census, `incp_gr` (weekly income), `cprf` (household size). These features will be merged into **`features_postcode`**, and then be merged into the master data


3. Time-series features: ranging from 2011-2021, use <u>time period</u> as key (`yields_join` (bond yields), `rates_join` (interest rates), `df_cons_clean` (construction activities). These features will be merged into **`features_timePeriod`**

help with *merge()* https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

### III-1 `features_LGA`

Merge `hhold`, `move` and `ageband`

In [61]:
features_LGA = hhold.merge(move, left_on='LGA', right_on='LGA')
features_LGA = features_LGA.merge(ageband, left_on='LGA', right_on='LGA')
features_LGA.head(1)

,LGA,hhold_count_2016,hhold_count_2021,hhold_count_delta,Births_16_21,Deaths_16_21,Natural change,Net Migration (all sources),population_2021,population_2016,pop_delta,Adult,Child,MiddleAge,Senior,Youth
0,ALBURY CITY,21940,23227,1287,3390.0,2219.0,1171.0,1031.0,54374.0,52171.0,2203.0,485,269,302,1519,-371

In [62]:
features_LGA.to_csv('Files/Population/Population_cleaned_081021.csv', index=False)

### III-2 `features_postcode`

Merge `incp_gr` (weekly income) and `cprf` (household size)

In [63]:
print("number of postcodes in incp:", len(set(incp_gr['postcode'])))
print("number of postcodes in cprf:", len(set(cprf['postcode'])))

number of postcodes in incp: 618
number of postcodes in cprf: 618

In [64]:
# Merge
features_postcode = pd.merge(incp_gr, cprf, on='postcode')
features_postcode.head()

,postcode,INCP_LOW,INCP_MID,INCP_HIGH,INCP_NEG_NIL,CPRF_2,CPRF_3,CPRF_4,CPRF_5,CPRF_6+,CPRF_na,CPRF_TOTAL_FAM_NO
0,2000,9307,5319,3929,3501,3453.0,857.0,354.0,54.0,21.0,8125.0,12861.0
1,2006,747,32,18,276,0.0,0.0,0.0,0.0,5.0,13.0,18.0
2,2007,2803,1458,718,2410,830.0,215.0,98.0,25.0,4.0,2524.0,3696.0
3,2008,3321,2496,1352,2779,1308.0,243.0,105.0,17.0,7.0,3813.0,5493.0
4,2009,2896,3232,3205,1040,2107.0,635.0,298.0,56.0,8.0,3321.0,6421.0

In [65]:
print("Number of postcodes in features_postcode:",len(set(features_postcode['postcode'])))

Number of postcodes in features_postcode: 618

### III-3 `features_timePeriod`
Merge`yields_join` (bond yields), `rates_join` (interest rates), `df_cons_clean` (construction activities)

In [66]:
print("number of time period in bond yields:", len(set(yields_join['time_period'])))
print("number of time period in interest rates:", len(set(rates_join['time_period'])))
print("number of time period in construction:", len(set(df_cons_clean['time_period'])))

number of time period in bond yields: 33
number of time period in interest rates: 43
number of time period in construction: 37

We'll only keep the shared time periods in the three dataframes.

In [67]:
# Merge
features_timePeriod = pd.merge(yields_join, df_cons_clean, on='time_period')
features_timePeriod = pd.merge(features_timePeriod, rates_join, on='time_period')
features_timePeriod.head()

  time_period  2yBonds%  10yBonds%  constr_index      Rate
0     2013 Q3  2.575000   3.868333         101.9  2.602273
1     2013 Q4  2.729167   4.112500         102.2  2.500000
2     2014 Q1  2.700000   4.135000         102.5  2.500000
3     2014 Q2  2.685000   3.835833         103.7  2.500000
4     2014 Q3  2.583333   3.474167         104.7  2.500000

In [68]:
# Check the number of time period after merge
len(set(features_timePeriod['time_period']))

32

In [69]:
features_timePeriod['time_period'].unique()

array(['2013 Q3', '2013 Q4', '2014 Q1', '2014 Q2', '2014 Q3', '2014 Q4',
       '2015 Q1', '2015 Q2', '2015 Q3', '2015 Q4', '2016 Q1', '2016 Q2',
       '2016 Q3', '2016 Q4', '2017 Q1', '2017 Q2', '2017 Q3', '2017 Q4',
       '2018 Q1', '2018 Q2', '2018 Q3', '2018 Q4', '2019 Q1', '2019 Q2',
       '2019 Q3', '2019 Q4', '2020 Q1', '2020 Q2', '2020 Q3', '2020 Q4',
       '2021 Q1', '2021 Q2'], dtype=object)

Even though we started with more time periods and end up with less, this is sufficient to cover the time periods in the housing data we're interested in.

*Note: It is possible to do the above in a single line of code, though for clarity, I've left it like this. As seen in https://stackoverflow.com/questions/23668427/pandas-three-way-joining-multiple-dataframes-on-columns*

## IV Merge Features into the Master Housing Data (Stacked)
`master_mg1`

### IV-1 `features_lga` $\xrightarrow{merge}$ master

In [70]:
master_LGA = list(master_map['LGA'].unique())
pop_LGA = list(features_LGA['LGA'].unique())
shared_LGA = list(set(master_LGA).intersection(pop_LGA))

print("Number of LGAs in the stacked:", len(master_LGA))
print("Number of shared LGAs in master df and population df:", len(shared_LGA))

Number of LGAs in the stacked: 129
Number of shared LGAs in master df and population df: 128

In [71]:
master_mg1 = master_map.merge(features_LGA, left_on='LGA', right_on='LGA')
master_mg1.head(1)

,postcode,LGA,skey,time_period,year,quarter,dwelling_type,median_price,mean_price,sales_no,...,Natural change,Net Migration (all sources),population_2021,population_2016,pop_delta,Adult,Child,MiddleAge,Senior,Youth
0,2000,SYDNEY,s122,2017 Q3,2017,Q3,Total,1350.0,1516.328059,135.0,...,8288.0,5887.0,236891.0,222717.0,14174.0,8187,3702,2389,3339,-3446

In [72]:
print("master_mg1 shape:", master_mg1.shape)
print("Number of LGAs in master_mg1:", master_mg1['LGA'].nunique())

master_mg1 shape: (35289, 37)
Number of LGAs in master_mg1: 128

### IV-2 `features_postcode`$\xrightarrow{merge}$ master

In [73]:
print("Number of unique postcodes in features_postcode:", 
      features_postcode['postcode'].nunique())
print("Number of unique postcodes in the housing data", 
      master_map['postcode'].nunique())

Number of unique postcodes in features_postcode: 618
Number of unique postcodes in the housing data 587

In [74]:
master_mg1 = master_mg1.merge(features_postcode, 
                              left_on='postcode', right_on='postcode')
master_mg1.head(1)

,postcode,LGA,skey,time_period,year,quarter,dwelling_type,median_price,mean_price,sales_no,...,INCP_MID,INCP_HIGH,INCP_NEG_NIL,CPRF_2,CPRF_3,CPRF_4,CPRF_5,CPRF_6+,CPRF_na,CPRF_TOTAL_FAM_NO
0,2000,SYDNEY,s122,2017 Q3,2017,Q3,Total,1350.0,1516.328059,135.0,...,5319,3929,3501,3453.0,857.0,354.0,54.0,21.0,8125.0,12861.0

In [75]:
print("master_merge1 shape:", master_mg1.shape)
print("Number of unique LGAs in master_merge1:", master_mg1['LGA'].nunique())
print("Number of unique postcodes in master_merge1:", master_mg1['postcode'].nunique())

master_merge1 shape: (35072, 48)
Number of unique LGAs in master_merge1: 128
Number of unique postcodes in master_merge1: 581

### IV-3 `features_timePeriod`$\xrightarrow{merge}$ master

In [76]:
features_timePeriod.head()

  time_period  2yBonds%  10yBonds%  constr_index      Rate
0     2013 Q3  2.575000   3.868333         101.9  2.602273
1     2013 Q4  2.729167   4.112500         102.2  2.500000
2     2014 Q1  2.700000   4.135000         102.5  2.500000
3     2014 Q2  2.685000   3.835833         103.7  2.500000
4     2014 Q3  2.583333   3.474167         104.7  2.500000

In [77]:
master_mg1 = master_mg1.merge(features_timePeriod, 
                              left_on='time_period', right_on='time_period')
master_mg1.head(1)

,postcode,LGA,skey,time_period,year,quarter,dwelling_type,median_price,mean_price,sales_no,...,CPRF_3,CPRF_4,CPRF_5,CPRF_6+,CPRF_na,CPRF_TOTAL_FAM_NO,2yBonds%,10yBonds%,constr_index,Rate
0,2000,SYDNEY,s122,2017 Q3,2017,Q3,Total,1350.0,1516.328059,135.0,...,857.0,354.0,54.0,21.0,8125.0,12861.0,1.814167,2.646667,112.0,1.5

In [78]:
print("master_merge1 shape:", master_mg1.shape)
print("Time periods in master_merge1:\n", master_mg1.time_period.unique())

master_merge1 shape: (35072, 52)
Time periods in master_merge1:
 ['2017 Q3' '2017 Q4' '2018 Q1' '2018 Q2' '2018 Q3' '2018 Q4' '2019 Q1'
 '2019 Q2' '2019 Q3' '2019 Q4' '2020 Q1' '2020 Q2' '2020 Q3' '2020 Q4'
 '2021 Q1']

Saving as CSV

In [79]:
master_mg1.to_csv('Files/Cleaned/Master_Sales_Rent_2017Q4_2021Q1_wFeatures.csv', index=False)

## V Merge Features into the Master Housing Data (Unstacked Ver1)
**`master_mg2`**

We're just repeating the same process in section IV and merge the features into the unstacked housing DF (ver1).

In [80]:
# Shorten df name to m_pvt1
m_pvt1 = master_pivot_map1
print("Unstacked master DF1 shape:", m_pvt1.shape)
print("Number of LGAs in the unstacked master DF1:", m_pvt1['LGA'].nunique())
print("Number of postcodes in the unstacked master DF1:", m_pvt1['postcode'].nunique())

Unstacked master DF1 shape: (858, 32)
Number of LGAs in the unstacked master DF1: 129
Number of postcodes in the unstacked master DF1: 493

**`features_lga` $\xrightarrow{merge}$ master**

In [81]:
# Merge features_LGA in
master_mg2 = m_pvt1.merge(features_LGA, left_on='LGA', right_on='LGA')

print("master_mg2 shape:", master_mg2.shape)
print("Number of LGAs in the master_mg2:", master_mg2['LGA'].nunique())

master_mg2 shape: (857, 47)
Number of LGAs in the master_mg2: 128

**`features_postcodes` $\xrightarrow{merge}$ master**

In [82]:
# Merge features_postcode in
master_mg2 = master_mg2.merge(features_postcode, 
                              left_on='postcode', right_on='postcode')
print("master_mg2 shape:", master_mg2.shape)
print("Number of postcodes in the master_mg2:", master_mg2['postcode'].nunique())

master_mg2 shape: (853, 58)
Number of postcodes in the master_mg2: 491

We lost 1 LGA and 2 postcodes through merging, they're unicorporated NSW and postcodes associated with it.

**`features_timePeriods` $\xrightarrow{merge}$ master**

In [83]:
# Filter out relevant time periods (Q1 2020 - Q1 2021)

TP = ['2020 Q1','2020 Q2','2020 Q3','2020 Q4','2021 Q1']
features_timePeriod = features_timePeriod.loc[features_timePeriod.time_period.isin(TP)]
features_timePeriod

   time_period  2yBonds%  10yBonds%  constr_index      Rate
26     2020 Q1  0.616667   1.006667         116.0  0.638889
27     2020 Q2  0.240000   0.896667         116.2  0.250000
28     2020 Q3  0.243333   0.890000         116.2  0.250000
29     2020 Q4  0.103333   0.890000         116.9  0.156250
30     2021 Q1  0.090000   1.353333         117.8  0.100000

Since the file is unstacked, we no longer have time_period as key. What we'll do here is to flat features dataframe into one-row. One feature will be expanded into five - one for each time period, and will be added as a column with a constant value to the master DataFrame.

In [84]:
# Flat the features DF
features_TP_pvt = pd.pivot_table(features_timePeriod, 
                                 index=features_timePeriod.index,
                                 columns='time_period',
                                 values=['2yBonds%', '10yBonds%', 'constr_index', 'Rate'])

features_TP_pvt.columns = [' '.join(col) for col in features_TP_pvt.columns]
features_TP_pvt = features_TP_pvt.append(features_TP_pvt.sum(numeric_only=True), ignore_index=True)
features_TP_pvt = features_TP_pvt.iloc[[-1]]
features_TP_pvt.reset_index(inplace=True)
features_TP_pvt = features_TP_pvt.drop(columns='index', axis=1)
features_TP_pvt.round(2)

features_TP_pvt

,10yBonds% 2020 Q1,10yBonds% 2020 Q2,10yBonds% 2020 Q3,10yBonds% 2020 Q4,10yBonds% 2021 Q1,2yBonds% 2020 Q1,2yBonds% 2020 Q2,2yBonds% 2020 Q3,2yBonds% 2020 Q4,2yBonds% 2021 Q1,Rate 2020 Q1,Rate 2020 Q2,Rate 2020 Q3,Rate 2020 Q4,Rate 2021 Q1,constr_index 2020 Q1,constr_index 2020 Q2,constr_index 2020 Q3,constr_index 2020 Q4,constr_index 2021 Q1
0,1.006667,0.896667,0.89,0.89,1.353333,0.616667,0.24,0.243333,0.103333,0.09,0.638889,0.25,0.25,0.15625,0.1,116.0,116.2,116.2,116.9,117.8

In [85]:
# Convert the one-row DF into a dictionary 
tp_dict = features_TP_pvt.to_dict("record")[0]
type(tp_dict)

/var/folders/22/9hdsbk0j58z1r2x79bx2zjh80000gn/T/ipykernel_66882/3357450296.py:2: FutureWarning: Using short name for 'orient' is deprecated. Only the options: ('dict', list, 'series', 'split', 'records', 'index') will be used in a future version. Use one of the above to silence this warning.
  tp_dict = features_TP_pvt.to_dict("record")[0]

dict

In [86]:
# Assign the dictionary to the master DF
master_mg2 = master_mg2.assign(**tp_dict)

print("master_mg2 shape:", master_mg2.shape)
master_mg2.head(1)

master_mg2 shape: (853, 78)

,postcode,LGA,mean_price 2020 Q1,mean_price 2020 Q2,mean_price 2020 Q3,mean_price 2020 Q4,mean_price 2021 Q1,median_price 2020 Q1,median_price 2020 Q2,median_price 2020 Q3,...,Rate 2020 Q1,Rate 2020 Q2,Rate 2020 Q3,Rate 2020 Q4,Rate 2021 Q1,constr_index 2020 Q1,constr_index 2020 Q2,constr_index 2020 Q3,constr_index 2020 Q4,constr_index 2021 Q1
0,2000,SYDNEY,1541.0,1322.0,1631.0,1379.0,2794.0,1225.0,1000.0,1390.0,...,0.638889,0.25,0.25,0.15625,0.1,116.0,116.2,116.2,116.9,117.8

In [87]:
# Save as CSV
master_mg2.to_csv('Files/Cleaned/Master_Pivot_Sales_Rent_5Quarters_SharedPOA_wFeatures.csv', index=False)

## VI Merge Features into the Master Housing Data (Unstacked Ver2)
**`master_mg2`**

Repeat the same process in section IV/V and merge the features into the unstacked housing DF (ver2).

In [88]:
# Shorten df name to m_pvt1
m_pvt2 = master_pivot_map2
print("Unstacked master DF2 shape:", m_pvt2.shape)
print("Number of LGAs in the unstacked master DF2:", m_pvt2['LGA'].nunique())
print("Number of postcodes in the unstacked master DF2:", m_pvt2['postcode'].nunique())

Unstacked master DF2 shape: (995, 32)
Number of LGAs in the unstacked master DF2: 129
Number of postcodes in the unstacked master DF2: 577

**`features_lga` $\xrightarrow{merge}$ master**

In [89]:
# Merge features_LGA in
master_mg3 = m_pvt2.merge(features_LGA, left_on='LGA', right_on='LGA')

print("master_mg3 shape:", master_mg3.shape)
print("Number of LGAs in the master_mg3:", master_mg3['LGA'].nunique())

master_mg3 shape: (994, 47)
Number of LGAs in the master_mg3: 128

**`features_postcodes` $\xrightarrow{merge}$ master**

In [90]:
# Merge features_postcode in
master_mg3 = master_mg3.merge(features_postcode, 
                              left_on='postcode', right_on='postcode')
print("master_mg3 shape:", master_mg3.shape)
print("Number of postcodes in the master_mg3:", master_mg3['postcode'].nunique())

master_mg3 shape: (988, 58)
Number of postcodes in the master_mg3: 573

Again we lost 1 LGA, 4 postcodes this time after merging.

**`features_timePeriods` $\xrightarrow{merge}$ master**

In [91]:
master_mg3 = master_mg3.assign(**tp_dict)

print("master_mg3 shape:", master_mg3.shape)
master_mg2.head(1)

master_mg3 shape: (988, 78)

,postcode,LGA,mean_price 2020 Q1,mean_price 2020 Q2,mean_price 2020 Q3,mean_price 2020 Q4,mean_price 2021 Q1,median_price 2020 Q1,median_price 2020 Q2,median_price 2020 Q3,...,Rate 2020 Q1,Rate 2020 Q2,Rate 2020 Q3,Rate 2020 Q4,Rate 2021 Q1,constr_index 2020 Q1,constr_index 2020 Q2,constr_index 2020 Q3,constr_index 2020 Q4,constr_index 2021 Q1
0,2000,SYDNEY,1541.0,1322.0,1631.0,1379.0,2794.0,1225.0,1000.0,1390.0,...,0.638889,0.25,0.25,0.15625,0.1,116.0,116.2,116.2,116.9,117.8

In [92]:
# Save as CSV
master_mg3.to_csv('Files/Cleaned/Master_Pivot_Sales_Rent_5Quarters_Imputed_wFeatures.csv', index=False)